cf/InformationRegisters/РабочиеДни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РабочиеДни</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выходной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/РабочиеДни/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьГрафик(Дата)
	
	текДата = НачалоМесяца(Дата);
	Пока НачалоМесяца(текДата) = НачалоМесяца(Дата) Цикл Запись = РегистрыСведений.РабочиеДни.СоздатьМенеджерЗаписи(); Запись.Дата = текДата; Запись.Выходной = ДеньНедели(текДата) > 5; ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Запись);текДата = текДата + 86400; КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Дата = ТекущаяДата();
	Если ВвестиДату(Дата, "День месяца", ЧастиДаты.Дата) Тогда
		
		ЗаполнитьГрафик(Дата);
		
	КонецЕсли;
	
КонецПроцедуры
